<policyDefinitions revision="1.0" schemaVersion="1.0">
  <policyNamespaces>
    <target prefix="fullarmor" namespace="FullArmor.Policies.E1CBA42F_6F60_476A_8762_0F5F102FB46D" />
    <using prefix="windows" namespace="Microsoft.Policies.Windows" />
  </policyNamespaces>
  <supersededAdm fileName="C:\Users\pavel\Desktop\AMAgent.adm" />
  <resources minRequiredRevision="1.0" />
  <supportedOn>
    <definitions>
      <definition name="SUPPORTED_NotSpecified" displayName="$(string.ADMXMigrator_NoSupportedOn)" />
    </definitions>
  </supportedOn>
  <categories>
    <category name="ALVAOAssetManagementAgent" displayName="$(string.unknown_0)" explainText="$(string.unknown_1)" />
  </categories>
  <policies>
    <policy name="WSUrl" class="Machine" displayName="$(string.unknown_2)" explainText="$(string.unknown_3)" presentation="$(presentation.WSUrl)" key="SOFTWARE\ALC\ALVAO Asset Management\Agent">
      <parentCategory ref="ALVAOAssetManagementAgent" />
      <supportedOn ref="SUPPORTED_NotSpecified" />
      <elements>
        <text id="AssetManagementWebService" valueName="WSUrl" />
      </elements>
    </policy>
    <policy name="AuthenticationCode" class="Machine" displayName="$(string.unknown_5)" explainText="$(string.unknown_6)" presentation="$(presentation.AuthenticationCode)" key="SOFTWARE\ALC\ALVAO Asset Management\Agent">
      <parentCategory ref="ALVAOAssetManagementAgent" />
      <supportedOn ref="SUPPORTED_NotSpecified" />
      <elements>
        <text id="Authenticationcode" valueName="AuthenticationCode" />
      </elements>
    </policy>
    <policy name="UseTCPConnection" class="Machine" displayName="$(string.unknown_8)" explainText="$(string.unknown_9)" presentation="$(presentation.UseTCPConnection)" key="SOFTWARE\ALC\ALVAO Asset Management\Agent">
      <parentCategory ref="ALVAOAssetManagementAgent" />
      <supportedOn ref="SUPPORTED_NotSpecified" />
      <elements>
        <enum id="UseTCPIPconnection" valueName="UseTCPConnection" required="true">
          <item displayName="$(string.unknown_11)">
            <value>
              <decimal value="0" />
            </value>
          </item>
          <item displayName="$(string.unknown_12)">
            <value>
              <decimal value="1" />
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy name="TCPConnectionPort" class="Machine" displayName="$(string.unknown_13)" explainText="$(string.unknown_14)" presentation="$(presentation.TCPConnectionPort)" key="SOFTWARE\ALC\ALVAO Asset Management\Agent">
      <parentCategory ref="ALVAOAssetManagementAgent" />
      <supportedOn ref="SUPPORTED_NotSpecified" />
      <elements>
        <decimal id="TCPport" valueName="nPort" />
      </elements>
    </policy>
  </policies>
</policyDefinitions>