<policyDefinitionResources revision="1.0" schemaVersion="1.0">
  <displayName>
  </displayName>
  <description>
  </description>
  <resources>
    <stringTable>
      <string id="unknown_0">ALVAO Asset Management Agent 64b</string>
      <string id="unknown_1">ALVAO Asset Management Agent 64b</string>
      <string id="unknown_2">WSUrl</string>
      <string id="unknown_5">AuthenticationCode</string>
      <string id="unknown_8">UseTCPConnection</string>
      <string id="unknown_13">TCP Connection Port</string>
      <string id="unknown_11">No, communicate through Web Service</string>
      <string id="unknown_12">Use TCP/IP</string>
      <string id="unknown_3">Enter AM WebService URL</string>
      <string id="unknown_6">Enter authentication code for Agent</string>
      <string id="unknown_9">Enable detection over TCP/IP.</string>
      <string id="unknown_14">Enter the TCP Connection port (optional)</string>
      <string id="ADMXMigrator_UnresolvedString">ADMX Migrator encountered a string that is not present in the source ADM string table.</string>
      <string id="ADMXMigrator_NoSupportedOn">ADMX Migrator encountered a policy that does not have a supportedOn value.</string>
    </stringTable>
    <presentationTable>
      <presentation id="WSUrl">
        <textBox refId="AssetManagementWebService">
          <label>Asset Management WebService</label>
          <defaultValue>
          </defaultValue>
        </textBox>
      </presentation>
      <presentation id="AuthenticationCode">
        <textBox refId="Authenticationcode">
          <label>Authentication code</label>
          <defaultValue>
          </defaultValue>
        </textBox>
      </presentation>
      <presentation id="UseTCPConnection">
        <dropdownList refId="UseTCPIPconnection" defaultItem="0">Use TCP/IP connection</dropdownList>
      </presentation>
      <presentation id="TCPConnectionPort">
        <decimalTextBox refId="TCPport" defaultValue="760">TCP port</decimalTextBox>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>